# SingleServerService Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SingleServerService Methods
SingleServerService Class See Also
---
The SingleServerService type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddServer | Registers a server with its service.  (Inherited from ExternalService.) |
| Dispose | (Inherited from ExternalService.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetActiveServerId()()()() | Returns the Id of the currently active application-level server of the service. |
| GetActiveServerId(Document) | Returns the Id of the server currently associated with the given document for the service. |
| GetDefaultServerId | Returns the Id of the default server if one was assigned to the service.  (Inherited from ExternalService.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetOptions | A copy of the options the service was registered with.  (Inherited from ExternalService.) |
| GetPublicAccessKey | Access key to use to execute a service.  (Inherited from ExternalService.) |
| GetRegisteredServerIds | Returns Ids of all servers registered for the service.  (Inherited from ExternalService.) |
| GetServer | Returns the instance that provides implementation for a registered server.  (Inherited from ExternalService.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsRegisteredServerId | Checks if the Id represents a valid server that has been registered for the service.  (Inherited from ExternalService.) |
| RemoveServer | Removes/unregisters a server from the service.  (Inherited from ExternalService.) |
| SetActiveServer(Guid) | Set an active server applicable application-wide for the service. |
| SetActiveServer(Guid, Document) | Change the active server for a specific document. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |
| UnsetActiveServer | Unset the active server for the particular document. |

# See Also
SingleServerService Class
Autodesk.Revit.DB.ExternalService Namespace